src/main/resources/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://wozu.com/soapDemo">
    <soapenv:Header>
    </soapenv:Header>
    <soapenv:Body>
        <us:getUserRequest>
            <us:name>Ryan</us:name>
        </us:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>